books/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "activated", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "แม็กนั่มคนสวย"], ["content", "สวยมากกกกกกกกก"], ["activated", 0], ["created_at", "2019-09-09 03:34:44.534841"], ["updated_at", "2019-09-09 03:34:44.534841"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_article
      @article = Article.find(params[:id])