books/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "author", "sales_amount", "is_available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Care Amazon"], ["author", "Maxnum"], ["sales_amount", 200], ["is_available", 1], ["created_at", "2019-09-11 08:54:52.662885"], ["updated_at", "2019-09-11 08:54:52.662885"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", " magnum ice cream"], ["updated_at", "2019-09-11 04:36:30.413729"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    @book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])